In [74]:
import pandas as pd
import numpy as np
df1=pd.DataFrame({'Roll_no':[1,2,3,4,5],"student_Name":["omkar","DK","SK","pk","MK"]})
df2=pd.DataFrame({'Roll_no':[1,2,3,4,5],"Marks":[56,None,89,90,45]})

In [75]:
df=pd.merge(df1,df2,on="Roll_no")
print(df)

   Roll_no student_Name  Marks
0        1        omkar   56.0
1        2           DK    NaN
2        3           SK   89.0
3        4           pk   90.0
4        5           MK   45.0

In [76]:
df.pivot(index="Roll_no",columns="student_Name",values="Marks")

student_Name  DK    MK    SK  omkar    pk
Roll_no
1            NaN   NaN   NaN   56.0   NaN
2            NaN   NaN   NaN    NaN   NaN
3            NaN   NaN  89.0    NaN   NaN
4            NaN   NaN   NaN    NaN  90.0
5            NaN  45.0   NaN    NaN   NaN

In [77]:
df.ffill(axis=0)

   Roll_no student_Name  Marks
0        1        omkar   56.0
1        2           DK   56.0
2        3           SK   89.0
3        4           pk   90.0
4        5           MK   45.0

In [78]:
df.backfill(axis='rows')

/tmp/ipykernel_4437/3437504993.py:1: FutureWarning: DataFrame.backfill/Series.backfill is deprecated. Use DataFrame.bfill/Series.bfill instead
  df.backfill(axis='rows')

   Roll_no student_Name  Marks
0        1        omkar   56.0
1        2           DK   89.0
2        3           SK   89.0
3        4           pk   90.0
4        5           MK   45.0

In [82]:
df2=pd.read_excel('/home/ubuntu/Downloads/document.xlsx')
print(df2)

    Sr.\nno. Roll No               Name of the Student  DM   FDS OOP  CG  \
0          1  SCOA01                     ALISHA SHEIKH  24  27.0  20  15
1          2  SCOA02         SOHAM JAYYANNTH DESHMUKKH  16   9.0   9  AB
2          3  SCOA03                SHELAR NEHA NILESH  20  23.0  16  15
3          4  SCOA04                       RIYA JAWALE  18  14.0  11   8
4          5  SCOA05             NARHE VARSHA RAOSAHEB  20  24.0  16  24
5          6  SCOA06           BHUTDA MAHESH SHANTILAL  20   9.0  AB   0
6          7  SCOA07              JAGTAP HARISH YUVRAJ  22  18.0   3  16
7          8  SCOA08         DESHPANDE SRUSHTI VINAYAK  24  20.0  19  16
8          9  SCOA09              DARWEY RUDRA GUNWANT  22  12.0   9  15
9         10  SCOA10                ERANDE TEJAS DIPAK  24  18.0  11  23
10        11  SCOA11             TRIPATHI VIKALP VIKAS  18  13.0   7  18
11        12  SCOA12  SHAIKH AMAAN AHMED SHAKEEL AHMED  20  23.0  24  21
12        13  SCOA13              MUNGASE SARTHAK ANIL  16  24.0  12  29
13        14  SCOA14                 GOYAL SURAJ MANOJ  16  19.0   9  13
14        15  SCOA15              DHAWNE DEVANG GANESH  18  21.0  12  12
15        16  SCOA16              SHELKE GAURAV GIRISH  20  19.0  12   9
16        17  SCOA17           KHATAL NANDINI RAJENDRA  12   NaN   5   7
17        18  SCOA18           BHUJBAL SRUSHTI VINAYAK  24  24.0  19  28
18        19  SCOA19       CHINCHANE SANSKRUTI GAJANAN  22  23.0   7  14
19        20  SCOA20                VIDULA VIKAS PATIL  20  24.0  16  26
20        21  SCOA21           BHONGALE OMKAR MADHUKAR  22  17.0  19  10

    DELD Gender
0     16      f
1      5      m
2     15      m
3     15      m
4     20      f
5     29      f
6      7      m
7     23      m
8      7      m
9      6      m
10    10      f
11     8      f
12     9      m
13    10      f
14    13      f
15    16      m
16    23      f
17    17      f
18    14      m
19    20      m
20    13      f

In [89]:
dg = df2.groupby('Gender')
dg.first()
dg.count()
print(dg.get_group('m'))

print(dg.get_group('f'))

    Sr.\nno. Roll No          Name of the Student  DM   FDS OOP  CG  DELD  \
1          2  SCOA02    SOHAM JAYYANNTH DESHMUKKH  16   9.0   9  AB     5
2          3  SCOA03           SHELAR NEHA NILESH  20  23.0  16  15    15
3          4  SCOA04                  RIYA JAWALE  18  14.0  11   8    15
6          7  SCOA07         JAGTAP HARISH YUVRAJ  22  18.0   3  16     7
7          8  SCOA08    DESHPANDE SRUSHTI VINAYAK  24  20.0  19  16    23
8          9  SCOA09         DARWEY RUDRA GUNWANT  22  12.0   9  15     7
9         10  SCOA10           ERANDE TEJAS DIPAK  24  18.0  11  23     6
12        13  SCOA13         MUNGASE SARTHAK ANIL  16  24.0  12  29     9
15        16  SCOA16         SHELKE GAURAV GIRISH  20  19.0  12   9    16
18        19  SCOA19  CHINCHANE SANSKRUTI GAJANAN  22  23.0   7  14    14
19        20  SCOA20           VIDULA VIKAS PATIL  20  24.0  16  26    20

   Gender
1       m
2       m
3       m
6       m
7       m
8       m
9       m
12      m
15      m
18      m
19      m
    Sr.\nno. Roll No               Name of the Student  DM   FDS OOP  CG  \
0          1  SCOA01                     ALISHA SHEIKH  24  27.0  20  15
4          5  SCOA05             NARHE VARSHA RAOSAHEB  20  24.0  16  24
5          6  SCOA06           BHUTDA MAHESH SHANTILAL  20   9.0  AB   0
10        11  SCOA11             TRIPATHI VIKALP VIKAS  18  13.0   7  18
11        12  SCOA12  SHAIKH AMAAN AHMED SHAKEEL AHMED  20  23.0  24  21
13        14  SCOA14                 GOYAL SURAJ MANOJ  16  19.0   9  13
14        15  SCOA15              DHAWNE DEVANG GANESH  18  21.0  12  12
16        17  SCOA17           KHATAL NANDINI RAJENDRA  12   NaN   5   7
17        18  SCOA18           BHUJBAL SRUSHTI VINAYAK  24  24.0  19  28
20        21  SCOA21           BHONGALE OMKAR MADHUKAR  22  17.0  19  10

    DELD Gender
0     16      f
4     20      f
5     29      f
10    10      f
11     8      f
13    10      f
14    13      f
16    23      f
17    17      f
20    13      f

In [81]:


# Print the grouped data
for gender, group in dg:
    print(f"--- {gender} ---")
    print(group[['Roll No', 'Name of the Student', 'DM', 'FDS', 'OOP', 'CG', 'DELD']])
    print("\n")

--- f ---
   Roll No               Name of the Student  DM   FDS OOP  CG DELD
0   SCOA01                     ALISHA SHEIKH  24  27.0  20  15   16
4   SCOA05             NARHE VARSHA RAOSAHEB  20  24.0  16  24   20
5   SCOA06           BHUTDA MAHESH SHANTILAL  20   9.0  AB   0   AB
10  SCOA11             TRIPATHI VIKALP VIKAS  18  13.0   7  18   10
11  SCOA12  SHAIKH AMAAN AHMED SHAKEEL AHMED  20  23.0  24  21   AB
13  SCOA14                 GOYAL SURAJ MANOJ  16  19.0   9  13   10
14  SCOA15              DHAWNE DEVANG GANESH  18  21.0  12  12   13
16  SCOA17           KHATAL NANDINI RAJENDRA  12   NaN   5   7   AB
17  SCOA18           BHUJBAL SRUSHTI VINAYAK  24  24.0  19  28   17
20  SCOA21           BHONGALE OMKAR MADHUKAR  22  17.0  19  10   13


--- m ---
   Roll No          Name of the Student  DM   FDS OOP  CG DELD
1   SCOA02    SOHAM JAYYANNTH DESHMUKKH  16   9.0   9  AB   AB
2   SCOA03           SHELAR NEHA NILESH  20  23.0  16  15   15
3   SCOA04                  RIYA JAWALE  18  14.0  11   8   15
6   SCOA07         JAGTAP HARISH YUVRAJ  22  18.0   3  16    7
7   SCOA08    DESHPANDE SRUSHTI VINAYAK  24  20.0  19  16   23
8   SCOA09         DARWEY RUDRA GUNWANT  22  12.0   9  15    7
9   SCOA10           ERANDE TEJAS DIPAK  24  18.0  11  23   AB
12  SCOA13         MUNGASE SARTHAK ANIL  16  24.0  12  29   AB
15  SCOA16         SHELKE GAURAV GIRISH  20  19.0  12   9   16
18  SCOA19  CHINCHANE SANSKRUTI GAJANAN  22  23.0   7  14   14
19  SCOA20           VIDULA VIKAS PATIL  20  24.0  16  26   20

In [90]:
correlation = df2['DM'].corr(df2['DELD'])

print(correlation)

0.005371949412945186

In [92]:
df2['DM'].describe()

count    21.000000
mean     19.904762
std       3.192253
min      12.000000
25%      18.000000
50%      20.000000
75%      22.000000
max      24.000000
Name: DM, dtype: float64

df2["DM"].drop_duplicates(

In [93]:
df2["DM"].drop_duplicates()

0     24
1     16
2     20
3     18
6     22
16    12
Name: DM, dtype: int64